{
  "data": {
    "news": {
      "totalResults": 16101,
      "status": "success",
      "results": [
        {
          "title": "Meralco bounces back with tough OT win over TNT in Game 2",
          "image_url": "https://images.gmanews.tv/webpics/2023/03/Aaron_Black_Meralco_v_TNT_Game_2_2023_03_26_19_34_42.JPG",
          "description": "The Meralco Bolts survived a tough overtime clash against the TNT Tropang Giga, 124-117, to equalize in their best-of-five semifinal series in the PBA Governors\" Cup on Sunday at the Ynares Center in Antipolo.",
          "source_id": "gmanetwork_ph",
          "pubDate": "2023-03-26 11:38:21",
          "link": "https://www.gmanetwork.com/news/sports/basketball/865099/meralco-bounces-back-with-tough-ot-win-over-tnt-in-game-2/story/",
          "content": "The Meralco Bolts survived a tough overtime clash against the TNT Tropang Giga, 124-117, to equalize in their best-of-five semifinal series in the PBA Governors’ Cup on Sunday at the Ynares Center in Antipolo. Meralco, , bounced back in this one as they tied the series, 1-1. Import KJ McDaniels, limited to just 12 points in the series opener, exploded for 39 points in Game 2, including some key baskets late in regulation. He also contributed 20 rebounds, four assists, three steals, and three blocks. Aaron Black, meanwhile, led the locals with 28 points on 12-of-19 shooting, including six crucial points in OT, alongside 10 assists. Meralco held a double-digit halftime lead, 59-49, but saw the advantage wiped away in a big third quarter from TNT thanks to some hot shooting from Mikey Williams, who scored 17 of his team’s 37 points in the period. The two teams entered the fourth quarter tied at 86-apiece. The Bolts got a pair of huge buckets from McDaniels late in the fourth, giving them a 112-109 lead late but his TNT counterpart, Rondae Hollis-Jefferson, kept TNT’s hopes alive as he drew some late fouls. Hollis-Jefferson got the first whistle while shooting a three, but could only knock down two of his three free throw attempts as the Tropang Giga came back to within one, 112-111, with 21.5 ticks left on the clock. After a crucial stop on the other end, the TNT import had an opportunity to give his team back the lead but a split from the line was the best he could do, and that sent the two teams to an extra five minutes to decide the game. But in the extra period, it was Black who took over, scoring six unanswered points as part of an 8-0 blast that gave Meralco a 122-114 advantage with 2:14 remaining before cruising to the win. Williams led TNT with a team-high 29 points, including six three-pointers, while Hollis-Jefferson posted 27 points, 15 boards, and nine assists in the loss. The two teams will look to break the their deadlock on Wednesday for the crucial Game 3.",
          "creator": null
        },
        {
          "title": "Samsung chief inspects production plants in China for first time in 3 years",
          "image_url": "http://img.koreatimes.co.kr/upload/thumbnailV2/6de05f4bd5ae47e09b2d3b0f75f19745.jpg",
          "description": "Lee Jae-yong, chairman of Samsung Electronics, visited China for the first time in three years to inspect Samsung Electro-Mechanics' multi-layer ceramic capacitor (MLCC) plant at a time when demand for the key component of electric vehicles (EV) is increasing, the company said Sunday. His visit drew particular attention as it came amid the U.S. government's intensifying efforts to curb the growth of China's chip industry by regulating semiconductor production by non-Chinese firms there.",
          "source_id": "koreatimes",
          "pubDate": "2023-03-26 11:35:05",
          "link": "https://koreatimes.co.kr/www/tech/2023/03/133_347849.html?utm_source=fl",
          "content": "Lee Jae-yong, chairman of Samsung Electronics, takes a look at products at Samsung Electro-Mechanics' MLCC plant in Tianjin, China, Friday. Courtesy of Samsung Electronics By Baek Byung-yeul Lee Jae-yong, chairman of Samsung Electronics, visited China for the first time in three years to inspect Samsung Electro-Mechanics' multi-layer ceramic capacitor (MLCC) plant at a time when demand for the key component of electric vehicles (EV) is increasing, the company said Sunday. His visit drew special attention as it came amid the U.S. government's intensifying efforts to curb the growth of China's chip industry by regulating semiconductor production by non-Chinese firms there. The Korean tech giant said Lee visited the northeastern Chinese city of Tianjin on Friday where Samsung Electro-Mechanics' plant is located to check how the business is performing and meet with Samsung Group employees working in the region. The Tianjin factory, which began operations in 2021, is one of the major production bases that supply MLCCs used in IT devices and cars, along with the company's Busan factory. An MLCC is a core component of electronic devices, controlling the stable flow of currents within electric circuits. Samsung Electro-Mechanics began developing and manufacturing MLCCs from 1988 and constructed the Tianjin factory in 2018 to meet the fast-growing demand for the products. While the traditional internal combustion engine-powered cars used between 3,000 to 10,000 MLCCs, electric cars, which have more electronic devices, require up to 20,000 MLCCs. Samsung Electro-Mechanics produces a variety of power MLCCs used in advanced driver assistance system (ADAS), anti-lock brake systems (ABS) and powertrains. Lee stressed the importance of accelerating MLCC product development for vehicles as a promising future business during his visit to Samsung Electro-Mechanics' Busan plant in 2020 and 2022. \"Samsung is trying to foster its Busan plant as an advanced research center that develops and produces core materials for MLCC and will keep operating its Tianjin plant as its major MLCC plant,\" the group said. Lee Jae-yong, center, chairman of Samsung Electronics, inspects Samsung Electro-Mechanics' MLCC plant in Tianjin, China, Friday. Courtesy of Samsung Electronics Prior to visiting the MLCC plant, Lee also had meetings with executives and employees of local Samsung Group affiliates, such as Samsung Electronics, Samsung Display, Samsung Electro-Mechanics and Samsung SDI and encouraged their efforts to minimize the impact of supply disruptions caused by the COVID-19 pandemic in the past few years. In Tianjin, Samsung Electro-Mechanics produces MLCCs and camera modules, Samsung Display makes OLED modules for smartphones and Samsung SDI manufactures battery cells for smart gadgets and EVs. During his visit to the Chinese city, Lee also met with Chen Min'er, the city's Communist Party secretary. The meeting took place between Tianjin government officials and Samsung executives, including Chang Duck-hyun, CEO of Samsung Electro-Mechanics, and Choi Joo-sun, CEO of Samsung Display. After completing his schedule in Tianjin, Lee moved to Beijing on Saturday to attend the China Development Forum (CDF), an annual meeting where global leaders discuss the latest trends. The CDF ends Monday.",
          "creator": ["baekby@koreatimes.co.kr(Baek Byung-yeul)"]
        },
        {
          "title": "Apple Pay service limited by lack of NFC terminals",
          "image_url": "http://img.koreatimes.co.kr/upload/thumbnailV2/6ac9dedaf54d4ce4920d6b2105967940.jpg",
          "description": "A 32-year-old surnamed Kim living in Gangseo District, Seoul, recently started using a credit card issued by Hyundai Card to use Apple Pay, which began its service here on March 21. After using it for nearly a week, Kim feels there are not many restaurants and coffee shops that have adopted the service yet.",
          "source_id": "koreatimes",
          "pubDate": "2023-03-26 11:35:05",
          "link": "https://koreatimes.co.kr/www/nation/2023/03/419_347833.html?utm_source=fl",
          "content": "A customer pays for a beverage with Apple Pay at a coffee shop in Seoul on March 21. Yonhap By Kim Jae-heun A 32-year-old surnamed Kim living in Gangseo District, Seoul, recently started using a credit card issued by Hyundai Card to use Apple Pay, which began its service here on March 21. After using it for nearly a week, Kim feels there are not many restaurants and coffee shops that have adopted the service yet. \"Convenience stores are the only places that support Apple Pay. Small restaurants and coffee shops in my town do not have near field communication (NFC) terminals installed at their stores,\" Kim said. \"I feel like it needs more time for people to use Apple Pay conveniently here and there.\" A 59-year-old housewife surnamed Choi was also disappointed to learn she cannot yet use Apple Pay at any of Shinsegae's affiliated stores. \"I didn't know I wouldn't be able to use Apple Pay at Shinsegae Department Store or Emart until I read news about it. Many housewives shop for groceries at Emart and it is inconvenient that the discount store doesn't support the payment system. It definitely needs to adopt the service as soon as possible,\" Choi said. Over one million people registered for Apple Pay on the first day of its launch, but many were disappointed by its usability. A number of people experienced a server error when using Apple Pay on the first two days, while many restaurants and coffee shops still did not have near field communication (NFC) terminals to enable payments. Shinsegae has not revealed any plan to support Apple Pay at any of its affiliated retailers including Starbucks Korea, the country's largest coffee house chain. Even some of the credit cards issued by Hyundai Card, a local partner of Apple Pay, cannot be linked with the mobile payment service. Its premium American Express Card that Hyundai Card has an exclusive partnership with does not support Apple Pay. Nor do the Diners and UnionPay brand cards that Hyundai Card offers. \"We will continue to expand the number of NFC terminals,\" the CEO of Hyundai Card Chung Tae-yong said on social media on March 23 after receiving many complaints that there aren't enough stores with NFC terminals. \"Many (restaurants and coffee shop) franchise firms are actively considering the service based on the initial response (from consumers).\"",
          "creator": ["jhkim@koreatimes.co.kr(Kim Jae-heun)"]
        },
        {
          "title": "Hyundai Motor Group, Busan citizens launch all-out campaign for World Expo 2030",
          "image_url": "http://img.koreatimes.co.kr/upload/thumbnailV2/12740a8bf7bd4591b91d84ead8795615.jpg",
          "description": "Hyundai Motor Group and residents of Busan have launched an all-out campaign to promote the city's bid to host World Expo 2030 as the automotive giant unveiled a promotional video showing Busan citizens introducing the southern port city's unique qualities in 15 different languages, Sunday.",
          "source_id": "koreatimes",
          "pubDate": "2023-03-26 11:35:05",
          "link": "https://koreatimes.co.kr/www/nation/2023/03/419_347845.html?utm_source=fl",
          "content": "Seen is a captured image from a campaign video, produced by Hyundai Motor Group promoting Busan's bid to host World Expo 2030. Courtesy of Hyundai Motor Group By Baek Byung-yeul Hyundai Motor Group and residents of Busan have launched an all-out campaign to promote the city's bid to host World Expo 2030 as the automotive giant unveiled a promotional video showing Busan citizens introducing the southern port city's unique qualities in 15 different languages, Sunday. The automotive giant released a video titled \"Busan Citizens Invite You All,\" which introduces Busan's strong will and capabilities to host the international event ― in the languages of the 15 member countries of the Bureau International des Expositions (BIE). The BIE is an intergovernmental organization in charge of overseeing and regulating the World Expo event, which is held every five years. Hyundai Motor Group also unveiled 16 one-minute short-form videos produced only in each member country's language so as to attract votes from the BIE member countries. \"We made these videos that show Busan citizens promoting their city's suitability and competitiveness for World Expo 2030 ahead of the BIE's inspection visit to Busan from April 2 to 7,\" the automotive group said. \"The move is also aimed at attracting support from BIE member countries around the world and creating enthusiasm for hosting the event in Busan at home and abroad.\" Busan aims to win hearts of developing nations in Expo 2030 bid 2023-03-26 17:24 | Foreign Affairs The group added that the videos can be watched on its official YouTube channel and Facebook. The group will also screen the videos during a supporting event for Busan's bid at Seoul's Gwanghwamun Square next month and Seoul Mobility Show 2023, which will take place in Goyang, Gyeonggi Province from March 31 to April 9. When Busan citizens introduce the city in the videos, major tourists spots of the city are also clearly visible in the background such as Gukje Market, Jagalchi Market, Yongdusan Park, Marine City, Busan Cinema Center and Hyundai Motorstudio Busan. A Busan citizen promotes the city's bid to host World Expo 2030 in Spanish in this campaign video. Courtesy of Hyundai Motor Group The video begins with a young man paddle-boarding on a beach in Busan asking the question \"Busan ― the city that best matches the World Expo, Why is it Busan\" in English, and ends with a Busan citizen using sign language to communicate that \"Busan is prepared.\" Hyundai Motor Group formed a task force team for the Expo in August, 2021 and has been making efforts to help the country host the international event by utilizing its global network and international events attended by key figures from across the world.",
          "creator": ["baekby@koreatimes.co.kr(Baek Byung-yeul)"]
        },
        {
          "title": "LIVE SCORING | Proteas win toss, bowl in 2nd West Indies T20",
          "image_url": "https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg",
          "description": "The Proteas will be determined to bounce back when they take on the West Indies in Sunday's second T20 clash.",
          "source_id": "thesouthafrican",
          "pubDate": "2023-03-26 11:34:19",
          "link": "https://www.thesouthafrican.com/sport/cricket/sa-cricket/live-scoring-proteas-versus-west-indies-second-t20-breaking-sunday-26-march-2023/",
          "content": "In a rain-affected first T20 on Saturday, the Proteas ultimately fell just short against the big-hitting West Indies outfit, losing by three wickets in a game that went down to the last over. ALSO READ: Kapp ‘heartbroken’ as Van Niekerk heads into shock retirement The Proteas have named a powerful squad for this series, with in-form Aiden Markram taking on the captaincy duties in a key new role for the talented batsman. It’s expected that there will be some changes made to the Proteas starting lineup for the second encounter. You can follow all the live scoring below, with play getting underway at 2pm: PROTEAS T20I SQUAD AGAINST WEST INDIES Aiden Markram (captain, Momentum Multiply Titans), Quinton de Kock (Momentum Multiply Titans), Bjorn Fortuin (DP World Lions), Reeza Hendricks (DP World Lions), Marco Jansen (Dafabet Warriors) , Heinrich Klaasen (Momentum Multiply Titans), Sisanda Magala (DP World Lions), David Miller (Hollywoodbets Dolphins), Lungi Ngidi (Momentum Multiply Titans), Anrich Nortje (Dafabet Warriors), Wayne Parnell (Six Gun Grill Western Province), Kagiso Rabada (DP World Lions), Rilee Rossouw (ITEC Knights), Tabraiz Shamsi (Momentum Multiply Titans), Tristan Stubbs (Dafabet Warriors). ALSO READ: Temba Bavuma laments dearth of Test cricket Proteas Team Management against West Indies Rob Walter (Head Coach), Khomotso Volvo Masubelele (Team Manager), JP Duminy (Batting Coach), Rory Kleinveldt (Bowling Coach), Wandile Gwavu (Fielding Coach), Matthew Reuben (Performance Analyst), Runeshan Moodley (Strength and Conditioning coach), Sizwe Hadebe (Physiotherapist), Dr Hashendra Ramjee (Team Doctor), Kyle Botha (Logistics and Masseur), Zunaid Wadee (Security), Lucy Davey (Media Manager). ALSO READ: Proteas complete series whitewash of West Indies SOUTH AFRICA T20 INTERNATIONAL SERIES AGAINST WEST INDIES Saturday, 25 March at 14:00 South Africa lost by three wickets to West Indies – SuperSport Park, Centurion Sunday, 26 March at 14:00 South Africa vs West Indies – SuperSport Park, Centurion Tuesday, 28 March at 18:00 South Africa vs West Indies – DP World Wanderers Stadium, Johannesburg IN CLOSING | Australian publication deletes ‘fat-shamed’ article on Proteas star",
          "creator": ["Craig Lewis"]
        },
        {
          "title": "Weird News: Boy born with no legs plays football with Cristiano Ronaldo [VIDEO]",
          "image_url": "https://www.thesouthafrican.com/wp-content/themes/jnews-child/assets/images/normal.jpeg.optimal.jpeg",
          "description": "Weird News Today brings you the most bizarre stories on the internet. These weird but true stories will have you questioning reality.",
          "source_id": "thesouthafrican",
          "pubDate": "2023-03-26 11:31:20",
          "link": "https://www.thesouthafrican.com/news/offbeat/boy-born-with-no-legs-plays-football-with-cristiano-ronaldo-breaking-26-march-2023/",
          "content": "Weird News Today brings you the most bizarre stories on the internet. These weird but true stories will have you questioning reality. Take a look at today’s selection of weird news. Weird news of the day: 26 March 2023 Meet Ali Turganbekov, the boy with no legs who warmed Ronaldo’s heart and dreams of being Paralympics champion. The 12-year-old has also played football with Lionel Messi and UFC’s Khabib as he works his way towards swimming competitively Visit our (less weird) BLOGS Watch more videos from The South African Need your news quickly? Watch daily News in a minute video from The South African YouTube page for all that you really need to know! Looking for a shortcut to The South African YouTube channel for more weird news? Find all the videos here for a quick illustrative version of all the news you really need to know! Enjoy a wide variety of videos from news , lifestyle , travel , sports , viral videos , and lots more! There is always something to watch here! Why not follow us on Facebook, Instagram, and TikTok while you’re at it for drive-through weird news, lol! Get ALL that you need to know on the go at your own convenience! Share with us the weirdest news you came across today on our email info@thesouthafrican.com or on WhatsApp to 060 011 0211",
          "creator": ["Arnold Charles"]
        },
        {
          "title": "Cyprus refugee stamp: the story of a symbol",
          "image_url": null,
          "description": "A striking image of what it meant for thousands forced to leave their homes serves as a reminder through its use thousands of times a day finds Eleni Philippou Launched just a few weeks after the invasion to help raise funds for those who has been forced to leave their...",
          "source_id": "cyprus_mail",
          "pubDate": "2023-03-26 11:30:02",
          "link": "https://cyprus-mail.com/2023/03/26/cyprus-refugee-stamp-the-story-of-a-symbol/",
          "content": "“ “ “ “ Prosfigosimo: A Stamp for the Refugees of Cyprus. The Story of a Symbol opens on Tuesday narrating the history of the stamp and its significance. A first part presents the circumstances from which the refugee stamp emerged, while a second focuses on the central artwork of the exhibition, the engraved woodcut by Greek artist A.Tassos. The third part concentrates on the influences that this artwork had on the artistic production of Cyprus and includes a selection of art that displays the consequences of contemporary refugeeism. The final section of Prosfigosimo is dedicated to the closed city of Famagusta as another reminder of displacement, division and barbed wire as A.Tassos’ engraving also depicts. “The seemingly insignificant refugee stamp,” Paphiti concluded, “has been present to this day, documenting that the reason for which it was established, namely the displacement and its consequences for the Cypriot people, continue to exist. Its presence is identified with the lives of those Cypriots, who are still refugees in their own country. The Refugee Child of A.Tassos, the ‘Kypriotaki’ (little Cypriot), as he called it, remains their most faithful and unwavering witness.” Prosfigosimo: A Stamp for the Refugees of Cyprus. The Story of a Symbol Exhibition by Maria Paphiti on the refugee stamp of Cyprus.",
          "creator": ["Eleni Philippou"]
        },
        {
          "title": "F2 draws first blood against PLDT to inch closer to PVL All-Filipino bronze",
          "image_url": "https://images.gmanews.tv/webpics/2023/03/PVL_2023_F2_vs_2023_03_26_19_17_38.jpg",
          "description": "The F2 Logistics Cargo Movers inched closer to a bronze medal finish after defeating the PLDT High Speed Hitters, 20-25, 25-22, 25-18, 25-17, on Sunday in the best-of-three battle for third series in the 2023 PVL All-Filipino Conference at the Mall of Asia Arena.",
          "source_id": "gmanetwork_ph",
          "pubDate": "2023-03-26 11:18:55",
          "link": "https://www.gmanetwork.com/news/sports/volleyball/865095/f2-draws-first-blood-against-pldt-to-inch-closer-to-pvl-all-filipino-bronze/story/",
          "content": "The F2 Logistics Cargo Movers inched closer to a bronze medal finish after defeating the PLDT High Speed Hitters, 20-25, 25-22, 25-18, 25-17, on Sunday in the best-of-three battle for third series in the 2023 PVL All-Filipino Conference at the Mall of Asia Arena. The win came as former head coach Ramil de Jesus also rallied behind F2, a day after he called the shots for De La Salle University. Kim Kianna Dy posted 20 points while Aby Maraño had 19 points in the Game 1 win. Ara Galang added 13 markers to her name on top of 18 excellent digs and 18 excellent receptions. Jules Samonte and Dell Palomata had 14 points apiece, while Jovie Prado made 13 points in the PLDT loss. Game 2 of the battle for third will be played on Tuesday at the same venue.",
          "creator": null
        },
        {
          "title": "Snl24.com | 'We are doomed' - Notoane should be blamed for Under-23 failure",
          "image_url": "https://scripts.24.co.za/img/sites/kickoff24.png",
          "description": "Former Mamelodi Sundowns attacker Brent Carelse insists South Africa Under-23 head coach David Notoane should take all the blame for his side's failure to beat Congo on Thursday.",
          "source_id": "snl24",
          "pubDate": "2023-03-26 11:18:34",
          "link": "https://www.snl24.com/KickOff/SANews/SA-National-Teams/we-are-doomed-notoane-should-be-blamed-for-under-23-failure-20230326",
          "content": "South Africa equalised in the second half to salvage a 1-1 draw against the visitors ahead of a difficult second-leg fixture in a two-legged Afcon qualifier in Congo-Brazzaville. Carelse says the national team now have a mountain to climb to ensure qualification for the continental tournament in June. \"We are doomed, these boys are not young players anymore they are adults,\" Carelse tells KickOff. \"Once you turn 18, 19 you are an adult. They get paid by professional clubs, and time for excuses is long done. \"When last did our national teams perform? Even Bafana Bafana haven't done anything in the past 15 years. Only the women have been doing well. \"The results should have been 1-0 or 2-0 to South Africa. It's our home game, we should qualify, but in South Africa, we are very good with excuses.\" Carelse says he was left baffled by Notoane's strange selections with the under-23 side producing an unconvincing display. \"The coach has to be blamed because he is the one who is picking the team. \"Let's hold on a bit with these boys who are based overseas. \"We must stop this thing of checking these boys on the internet, someone must go there and watch these boys play. \"We don't know these overseas-based boys we have never seen them play. Let's rather play the ones we have seen play. \"It's embarrassing, even in 2010 it was the same story. Lendaba yokuthi kumele ube ku national team just because udlala overseas ayikho. \"What happened is these boys don't know each other, but the local ones know each other, for them it's easier to gel hence Shabalala spotted Maseko easily. \"Our country is different we cannot compare ourselves to Morocco and the other countries, we are different we have 11 different languages, and we have how many different cultures? \"We must give our local-based players the opportunity. If you come from abroad, you need to be better than the locally based players. \"You can't come here from Europe or wherever and look like an average player who never played football.\"",
          "creator": null
        },
        {
          "title": "Snl24.com | Stellies remain keen on SuperSport United's Gabuza",
          "image_url": "https://scripts.24.co.za/img/sites/kickoff24.png",
          "description": "DStv Premiership side Stellenbosch FC reportedly remain strongly interested in the services of veteran striker Thamsanqa Gabuza after an initial deal failed in the January transfer window.",
          "source_id": "snl24",
          "pubDate": "2023-03-26 11:18:34",
          "link": "https://www.snl24.com/KickOff/SANews/Premiership/Stellenbosch-FC/stellies-remain-keen-on-supersport-uniteds-gabuza-20230326",
          "content": "Stellies fell just short of completing a deadline day transfer for Gabuza as Steve Barker aimed to strengthen his frontline for the remainder of the current season. \"Ganda Ganda\" was also linked with a move to Royal AM earlier in the season, with SuperSport turning down an offer from the KwaZulu-Natal-based outfit. Gabuza's contract with SuperSport is due to expire in June this year. \"Stellenbosch have not lost interest. They are still keen to sign him for next season,\" a source close to the player's camp tells KickOff. \"He has not yet signed anything with SuperSport which could give him the opportunity to move for free when his contract expires in June.\"",
          "creator": null
        }
      ]
    }
  }
}
